InformationRegisters/СоответствиеНаименованийИСсылокЕдиницИзмеренийИТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНаименованийИСсылокЕдиницИзмеренийИТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НоменклатураЭСФ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЕдиницаИзмеренияЭСФ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентПересчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентЭСФ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючАналитикиСоответствия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеНаименованийИСсылокЕдиницИзмеренийИТоваров/Ext/ManagerModule.bsl
// Функция получает элемент справочника - ключ аналитики учета.
//
// Параметры:
//	ПараметрыСоответствия - Выборка или Структура  с полями "Контрагент, КлючАналитики, Товар, ЕдиницаИзмерения, КоэффициентПересчета".
//
//
Процедура СоздатьЗаписьСоответствия(ПараметрыСоответствия) Экспорт
				
	Если ЗначениеЗаполнено(ПараметрыСоответствия.Контрагент)
		И ТипЗнч(ПараметрыСоответствия.Контрагент) = Тип("СправочникСсылка.Контрагенты") 
		И ЗначениеЗаполнено(ПараметрыСоответствия.КлючАналитикиСоответствия)
		И (ЗначениеЗаполнено(ПараметрыСоответствия.Товар) 
		ИЛИ ЗначениеЗаполнено(ПараметрыСоответствия.ЕдиницаИзмерения)) Тогда
		
				
		МенеджерЗаписи = РегистрыСведений.СоответствиеНаименованийИСсылокЕдиницИзмеренийИТоваров.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыСоответствия);
		Если ПараметрыСоответствия.КоэффициентПересчета = 0 Тогда
			МенеджерЗаписи.КоэффициентПересчета = 1;
		КонецЕсли;
      
		МенеджерЗаписи.Записать(Истина);					
		
	КонецЕсли;
		
КонецПроцедуры
